app/controllers/blogs_controller.rb

  def create
    @blog = current_user.blogs.build(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "gzim"], ["description", "asani"], ["created_at", "2020-12-07 09:51:44.585885"], ["updated_at", "2020-12-07 09:51:44.585885"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "gzim the first article"], ["description", "asani the second article!"], ["updated_at", "2020-12-07 10:33:57.522096"], ["id", 4]]